{
    "single": {
        "D": {
            "title": "### Personnalité Dominance (D)",
            "description": "Vous êtes un leader né, animé par le résultat et la volonté de concrétiser les projets. Vous êtes décisif, affirmé et sûr de vous. Vous excellez dans les environnements stimulants et n'avez pas peur de prendre des risques ni de prendre des décisions difficiles. Vous privilégiez l'action à l'analyse, et on se tourne souvent vers vous lorsqu'il faut faire des choix rapides et audacieux. Dans les situations compétitives, vous excellez, trouvant votre motivation dans l'atteinte des objectifs les plus ambitieux. Votre énergie est concentrée sur l'obtention de résultats, et vous êtes susceptible de vous pousser vous-même et de pousser les autres à donner le meilleur d'eux-mêmes. Bien que votre approche directe puisse parfois paraître exigeante, votre vision globale vous permet souvent de voir des opportunités là où d'autres ne voient que des obstacles.",
            "strengths": "Forces : Décisif, orienté résultats, résolveur de problèmes, autonome, preneur de risques, visionnaire.",
            "challenges": "Peut être perçu comme exigeant, impatient ou insensible. Vous devriez peut-être travailler sur votre écoute des opinions des autres, favoriser la collaboration et trouver un équilibre entre votre dynamisme et l'empathie envers ceux qui ont un rythme ou une approche différente."
        },
        "I": {
            "title": "### Personnalité Influence (I)",
            "description": "Vous êtes une personne enthousiaste et optimiste, dotée d'un don naturel pour créer des liens avec les autres. Persuasif et captivant, vous vous épanouissez dans les interactions sociales où vous pouvez partager vos idées et inspirer votre entourage. Votre énergie et votre chaleur humaine attirent les gens, faisant de vous un as du réseautage et du travail d'équipe. Vous percevez le potentiel des autres et les encouragez à poursuivre leurs objectifs. Aimant être entouré, vous excellez généralement dans les environnements où le travail d'équipe, la collaboration et la créativité sont valorisés. Cependant, votre goût pour la spontanéité peut parfois vous amener à vous disperser ou à négliger des détails importants. Néanmoins, votre capacité à fédérer les gens autour d'une cause ou d'une idée est un atout précieux pour toute équipe ou tout projet.",
            "strengths": "Persuasif, optimiste, enthousiaste, fédérateur, excellent communicateur, inspirant.",
            "challenges": "Peut paraître trop bavard ou facilement distrait. Vous devrez peut-être travailler votre attention aux détails, le respect de vos engagements et veiller à ce que votre enthousiasme n'éclipse pas les étapes pratiques nécessaires à la réalisation de vos objectifs."
        },
        "S": {
            "title": "### Personnalité Stabilité (S)",
            "description": "Vous êtes un membre d'équipe fiable et solidaire qui valorise la stabilité, l'harmonie et les relations durables. Vous apportez calme et constance en toutes circonstances, faisant preuve de patience et de compréhension envers votre entourage. Vous avez tendance à éviter les conflits, préférant les environnements où la coopération et la paix sont primordiales. Votre loyauté envers vos amis, votre famille et vos collègues est sans faille, et vous excellez dans les rôles où vous pouvez aider les autres sans vous sentir pressé(e). Vous êtes un excellent auditeur/une excellente auditrice, exerçant souvent une influence apaisante au sein de votre équipe ou de votre groupe. Bien que vous puissiez être réticent(e) au changement et à l'imprévisibilité, lorsque le plan est clair, vous le mettez en œuvre avec détermination. On sait que l'on peut compter sur vous, même dans les moments difficiles.",
            "strengths": "Patient(e), loyal(e), solidaire, à l'écoute, esprit d'équipe, fiable.",
            "challenges": "Vous avez tendance à éviter les conflits ou le changement, et vous pourriez avoir besoin de travailler votre affirmation de soi et l'expression de vos besoins. Il vous arrive d'hésiter lorsque des décisions rapides sont nécessaires ou dans des environnements très compétitifs."  
      },
        "C": {
            "title": "### Personnalité Consciencieux (C)",
            "description": "Vous êtes une personne minutieuse et analytique, avec un sens aigu de l'exactitude, de la structure et de la précision. Vous êtes fier(ère) de produire un travail de grande qualité et êtes souvent la personne vers laquelle on se tourne lorsqu'une analyse approfondie ou une réflexion méthodique sont requises. Votre approche est rigoureuse et exhaustive, ce qui fait de vous un(e) excellent(e) solutionneur(euse) de problèmes dans des situations complexes. Exigeant(e), vous vous imposez le même niveau d'exigence qu'aux autres. Si votre souci du détail est une force, il peut aussi vous rendre moins à l'aise face à l'ambiguïté ou aux changements rapides. Néanmoins, votre engagement envers l'excellence garantit un travail toujours bien pensé et fiable.",
            "strengths": "Esprit analytique, souci du détail, organisation, conscience professionnelle, aptitude à résoudre les problèmes, exigence.",
            "challenges": "Peut être perçu(e) comme excessivement critique ou perfectionniste. Vous devrez peut-être travailler votre capacité d'adaptation au changement, votre aptitude à lâcher prise dans les situations collaboratives et votre compréhension que tout ne requiert pas une solution parfaite."
        },
        "DI": {
            "title": "### Personnalité Dominance (D) + Influence (I)",
            "description": "Vous êtes un leader charismatique et persuasif qui excelle dans les environnements dynamiques. Naturellement affirmé, vous aimez prendre les rênes et vous vous montrez enthousiaste et inspirant pour votre entourage. Votre confiance en vous vous permet d'influencer les autres avec aisance et vous êtes souvent au cœur de l'action, menant les équipes vers des objectifs ambitieux. Votre optimisme et votre énergie sont contagieux et votre style de leadership attire, surtout sous pression. Cependant, vous pouvez avoir des difficultés avec les détails ou la délégation de tâches, préférant gérer les situations vous-même. Si cette combinaison vous rend très efficace pour motiver les autres, il est important d'équilibrer votre dynamisme avec une réflexion sur les stratégies et les plans à long terme.",
            "strengths": "Décisif, confiant, visionnaire, inspirant, persuasif, énergique.",
            "challenges": "Peut être perçu comme impatient ou trop affirmé, peut avoir des difficultés à déléguer et peut être facilement distrait par de nouvelles opportunités ou de nouveaux défis sans mener à bien les tâches en cours."
        },
        "DC": {
            "title": "### Personnalité Dominance (D) + Consciencieux (C)",
            "description": "Vous êtes un leader stratégique et analytique qui valorise la précision et l'exactitude. Vous êtes motivé par la réussite et vous vous fixez des objectifs ambitieux, tout en privilégiant une planification rigoureuse et une exécution sans faille. Cette combinaison d'assurance et de souci du détail vous permet de prendre des décisions éclairées et basées sur les données. Votre capacité à penser de manière critique et à agir avec détermination fait de vous un atout précieux dans les environnements où la logique et le leadership sont essentiels. Cependant, votre exigence peut parfois vous rendre critique envers les autres, surtout lorsqu'ils ne répondent pas à vos attentes. Il est important pour vous de trouver un équilibre entre la recherche de la perfection et le fait de laisser aux autres la liberté de contribuer sans qu'ils se sentent microgérés.",
            "strengths": "Stratégique, décisif, analytique, organisé, orienté résultats, attentif aux détails.",
            "challenges": "Peut être perçu comme critique ou perfectionniste. Vous pouvez avoir des difficultés à déléguer des tâches ou à vous adapter à des situations exigeant une action rapide sans être capable d'analyser chaque détail."
        },
        "IS": {
            "title": "### Personnalité Influence (I) + Stabilité (S)",
            "description": "Vous êtes une personne chaleureuse et solidaire, qui favorise la collaboration et l'harmonie au sein d'une équipe. Naturellement empathique, vous appréciez les relations humaines. Votre sociabilité et votre stabilité font de vous un ami et un collègue de confiance, car vous êtes à la fois accessible et fiable. Votre capacité à valoriser les autres attire les gens, et vous excellez dans les environnements qui valorisent le travail d'équipe et l'entraide. Cependant, votre préférence pour l'harmonie peut vous amener à éviter les conflits ou les conversations difficiles. Apprendre à vous affirmer lorsque nécessaire vous permettra de faire entendre votre voix, même dans les situations exigeant des décisions difficiles.",
            "strengths": "Empathique, solidaire, collaboratif, patient, à l'écoute, fédérateur d'équipe.",
            "challenges": "Tendance à éviter les conflits, parfois trop conciliant, et difficultés à s'affirmer, notamment face à des personnalités plus dominantes."
        },
        "SC": {
            "title": "### Personnalité Stabilité (S) + Consciencieux (C)",
            "description": "Vous êtes une personne fiable et méthodique qui valorise la précision, la constance et la stabilité. Vous abordez les tâches avec patience et un grand souci du détail, veillant à ce que tout soit fait correctement et minutieusement. Votre calme et votre sang-froid sont appréciés de tous, car vous gardez le cap même dans les situations difficiles. Vos compétences organisationnelles et votre approche méthodique vous rendent particulièrement efficace dans les rôles qui exigent une planification à long terme et de la constance. Cependant, vous pouvez être réticent(e) au changement et hésiter à prendre des décisions hâtives. Il est important de savoir reconnaître quand la flexibilité et l'adaptabilité sont nécessaires pour aller de l'avant, même si cela implique de sortir de votre zone de confort.",
            "strengths": "Fiable, constant(e), soucieux(se) du détail, organisé(e), patient(e), méthodique.",
            "challenges": "Peut être réticent(e) au changement, avoir des difficultés à prendre des décisions rapidement et être perçu(e) comme inflexible ou excessivement prudent(e) dans des environnements dynamiques."
        },
        "CD": {
            "title": "### Personnalité Consciencieux (C) + Dominance (D)",
            "description": "Vous alliez un esprit analytique aiguisé à une forte motivation. Vous veillez à ce que vos décisions soient fondées sur la logique et les données, mais une fois la décision prise, vous poursuivez vos objectifs avec détermination et assurance. Cette combinaison de qualités fait de vous à la fois un penseur critique et un homme d'action, une combinaison précieuse pour les postes de direction. Vous excellez dans les environnements où précision et résultats sont tout aussi importants. Cependant, votre exigence et votre souci du détail peuvent parfois ralentir la prise de décision ou vous rendre trop critique envers le travail des autres. Apprendre à équilibrer votre besoin de contrôle avec votre capacité à faire confiance et à déléguer renforcera votre efficacité en tant que leader.",
            "strengths": "Stratégique, décisif, analytique, organisé, orienté résultats, logique.",
            "challenges": "Peut être perçu comme critique ou perfectionniste, peut avoir des difficultés à déléguer des tâches et peut se focaliser excessivement sur les détails, ce qui entraîne des retards dans la mise en œuvre."
        },
        "ID": {
            "title": "### Personnalité Influence (I) + Dominance (D)",
            "description": "Vous possédez une combinaison unique de charisme et de détermination, ce qui fait de vous un leader dynamique tant dans la sphère sociale que professionnelle. Naturellement persuasif, votre assurance vous permet de prendre les rênes dans les situations exigeant réactivité et efficacité. Votre enthousiasme et votre énergie sont contagieux, vous aidant à rallier les autres à votre vision. Cependant, il peut vous arriver de négliger des détails importants ou d'agir trop vite, ce qui peut engendrer des erreurs. Trouver un équilibre entre votre sociabilité et votre besoin de réflexion vous permettra de prendre de meilleures décisions à long terme, tout en tirant parti de votre capacité à inspirer l'action chez les autres.",
            "strengths": "Confiant, énergique, inspirant, déterminé, persuasif, orienté vers l'action.",
            "challenges": "Peut avoir du mal à ralentir ou à se concentrer sur les détails, peut paraître trop autoritaire et peut foncer tête baissée sans avoir pleinement pris en compte tous les facteurs."
        },
        "SI": {
            "title": "### Personnalité Stabilité (S) + Influence (I) ",
            "description": "Vous êtes une personne compatissante et sociable qui excelle dans la création de relations harmonieuses. Vous appréciez le travail d'équipe et vous vous efforcez de maintenir l'équilibre et la stabilité dans votre environnement. Votre empathie et votre enthousiasme font de vous un excellent membre d'équipe, car vous savez créer des liens personnels tout en conservant un calme imperturbable. Cependant, vous avez parfois tendance à éviter les conflits ou les situations difficiles qui vous obligeraient à vous affirmer davantage. Apprendre à défendre vos positions, même lorsque c'est inconfortable, vous permettra de devenir un leader plus affirmé tout en préservant votre chaleur et votre accessibilité naturelles.",
            "strengths": "Empathique, sociable, collaboratif, solidaire, chaleureux, patient.",
            "challenges": "Tendance à éviter les conflits, à être trop conciliant ou hésitant à prendre des décisions audacieuses, et à devoir travailler sur votre affirmation de soi dans les situations difficiles."
        },
        "CS": {
            "title": "### Personnalité Consciencieux (C) + Stabilité (S) ",
            "description": "Vous possédez une combinaison unique de conscience professionnelle et de constance, ce qui fait de vous une personne très fiable et méthodique. Vous excellez dans les rôles où le souci du détail et la rigueur sont essentiels. Votre approche organisée et systématique garantit la réalisation des projets avec soin et précision, et votre nature calme et posée apporte un sentiment de stabilité à votre entourage. Vous ne prenez pas de décisions à la hâte et préférez analyser les faits avant d'agir. Cependant, cette combinaison peut parfois vous rendre réfractaire au changement ou excessivement prudent lorsqu'une action rapide est nécessaire. Apprendre à vous adapter aux nouvelles situations et à être plus à l'aise avec l'incertitude vous permettra de progresser.",
            "strengths": "Souci du détail, constance, organisation, fiabilité, patience, méthode.",
            "challenges": "Peut présenter une résistance au changement ou à la prise de décision rapide, une prudence excessive ou une hésitation dans les environnements incertains, et nécessiter un travail sur votre flexibilité lorsque les situations exigent une adaptation rapide."
        }
    }
}